dialog-semiconductor/Flash-Universal-Flashloader/mcu/NXP/IMXRT500/sdk/fsl_power.c
    pmsk = __get_PRIMASK();
    __disable_irq();

    /* Enter FBB mode first */
    if (POWER_GetBodyBiasMode(kCfg_Run) != kPmu_Fbb)
    {
        POWER_EnterFbb();
    }

    volt = POWER_CalcVoltLevel(cm33_clk_freq, dsp_clk_freq);
    if (volt < 0x13U) /* < 0.8V */
    {
        POWER_DisableLVD();
    }
    else
    {
        if (volt < 0x1DU) /* < 0.9V */
        {
            PMC_DECREASE_LVD_LEVEL_IF_HIGHER_THAN(kLvdFallingTripVol_795);
        }
        else if (volt < 0x26U) /* < 1.0V */
        {
            PMC_DECREASE_LVD_LEVEL_IF_HIGHER_THAN(kLvdFallingTripVol_885);
        }
    }

    /* Configure vddcore voltage value */
    PMC->RUNCTRL = volt;
    POWER_ApplyPD();

    if (volt >= 0x13U) /* >= 0.8V */
    {
        POWER_RestoreLVD();
    }

    __set_PRIMASK(pmsk);
}

void POWER_SetLvdFallingTripVoltage(power_lvd_falling_trip_vol_val_t volt)
{
    PMC->LVDCORECTRL = PMC_LVDCORECTRL_LVDCORELVL(volt);
    POWER_ApplyPD();
}

power_lvd_falling_trip_vol_val_t POWER_GetLvdFallingTripVoltage(void)
{
    return (power_lvd_falling_trip_vol_val_t)((PMC->LVDCORECTRL & PMC_LVDCORECTRL_LVDCORELVL_MASK) >>
                                              PMC_LVDCORECTRL_LVDCORELVL_SHIFT);
}

AT_QUICKACCESS_SECTION_CODE(static void delay(uint32_t count))
{
    uint32_t i = 0;
    for (i = 0; i < count; ++i)
    {
        __asm("NOP");
    }
}

AT_QUICKACCESS_SECTION_CODE(static void deinitXip(void))
{
    if (IS_XIP_FLEXSPI0())
    { /* FlexSPI0 */
        /* Wait until FLEXSPI is not busy */
        while (!((FLEXSPI0->STS0 & FLEXSPI_STS0_ARBIDLE_MASK) && (FLEXSPI0->STS0 & FLEXSPI_STS0_SEQIDLE_MASK)))
        {
        }
        /* Disable module. */
        FLEXSPI0->MCR0 |= FLEXSPI_MCR0_MDIS_MASK;
        /* Disable clock. */
        CLKCTL0->PSCCTL0_CLR = CLKCTL0_PSCCTL0_CLR_FLEXSPI0_OTFAD_CLK_MASK;
    }
    else if (IS_XIP_FLEXSPI1())
    { /* FlexSPI1 */
        /* Wait until FLEXSPI is not busy */
        while (!((FLEXSPI1->STS0 & FLEXSPI_STS0_ARBIDLE_MASK) && (FLEXSPI1->STS0 & FLEXSPI_STS0_SEQIDLE_MASK)))
        {
        }
        /* Disable module. */
        FLEXSPI1->MCR0 |= FLEXSPI_MCR0_MDIS_MASK;
        /* Disable clock. */
        CLKCTL0->PSCCTL0_CLR = CLKCTL0_PSCCTL0_CLR_FLEXSPI1_CLK_MASK;
    }
    else
    {
    }
}

AT_QUICKACCESS_SECTION_CODE(static void initFlexSPI(FLEXSPI_Type *base))
{
    uint32_t status;
    uint32_t lastStatus;
    uint32_t retry;

    /* Enable FLEXSPI module */
    base->MCR0 &= ~FLEXSPI_MCR0_MDIS_MASK;

    base->MCR0 |= FLEXSPI_MCR0_SWRESET_MASK;
    while (base->MCR0 & FLEXSPI_MCR0_SWRESET_MASK)
    {
    }

    /* Need to wait DLL locked if DLL enabled */
    if (0U != (base->DLLCR[0] & FLEXSPI_DLLCR_DLLEN_MASK))
    {
        lastStatus = base->STS2;
        retry      = FLEXSPI_DLL_LOCK_RETRY;
        /* Wait slave delay line locked and slave reference delay line locked. */
        do
        {
            status = base->STS2;
            if ((status & (FLEXSPI_STS2_AREFLOCK_MASK | FLEXSPI_STS2_ASLVLOCK_MASK)) ==
                (FLEXSPI_STS2_AREFLOCK_MASK | FLEXSPI_STS2_ASLVLOCK_MASK))
            {
                /* Locked */
                retry = 100;
                break;
            }
            else if (status == lastStatus)
            {
                /* Same delay cell number in calibration */
                retry--;
            }
            else
            {
                retry      = FLEXSPI_DLL_LOCK_RETRY;
                lastStatus = status;
            }
        } while (retry > 0);
        /* According to ERR011377, need to delay at least 100 NOPs to ensure the DLL is locked. */
        for (; retry > 0U; retry--)
        {
            __NOP();
        }
    }
}

AT_QUICKACCESS_SECTION_CODE(static void initXip(void))
{
    if (IS_XIP_FLEXSPI0())
    { /* FlexSPI0 */
        /* Enable FLEXSPI clock again */
        CLKCTL0->PSCCTL0_SET = CLKCTL0_PSCCTL0_SET_FLEXSPI0_OTFAD_CLK_MASK;
        /* Re-enable FLEXSPI module */
        initFlexSPI(FLEXSPI0);
    }
    else if (IS_XIP_FLEXSPI1())
    { /* FlexSPI1 */
        /* Enable FLEXSPI clock again */
        CLKCTL0->PSCCTL0_SET = CLKCTL0_PSCCTL0_SET_FLEXSPI1_CLK_MASK;
        /* Re-enable FLEXSPI module */
        initFlexSPI(FLEXSPI1);
    }
    else
    {
    }
}

AT_QUICKACCESS_SECTION_CODE(static void countPartitionSwitches(uint32_t numPerSwitch,
                                                               uint32_t *pFastSwitches,
                                                               uint32_t *pSlowSwitches))
{
    uint32_t i;
    const uint32_t bitmap =
        0x3CCF3CU; /* Bit value 1 stands for containing slow memory, 0 stands for fast memory only. */

    if (numPerSwitch != 1)
    {
        numPerSwitch = 1;
    }

    *pFastSwitches = 0U;
    *pSlowSwitches = 0U;
    /* Each control contains APD & PPD */
    /* PQ, FLEXSPI, USBHS, USDHC0, USDHC1, CASPER, GPU, SMARTDMA, MIPI DSI, LCDIF */
    for (i = 0U; i < 22U; i += 2U)
    {
        if ((((SYSCTL0->PDRUNCFG1 & (1U << i)) == 0) && ((SYSCTL0->PDSLEEPCFG1 & (1U << i)) != 0)) ||
            (((SYSCTL0->PDRUNCFG1 & (1U << (i + 1))) == 0) && ((SYSCTL0->PDSLEEPCFG1 & (1U << (i + 1))) != 0)))
        {
            if (((3U << i) & bitmap) == 0)
            {
                (*pFastSwitches)++;
            }
            else
            {
                (*pSlowSwitches)++;
            }

            /* FlexSPI and LCDIF have both fast and slow memory controller */
            if (i == 2U || i == 4U || i == 20U)
            {
                (*pFastSwitches)++;
            }
        }
    }

    /* ROM */
    if (((SYSCTL0->PDRUNCFG1 & (1U << 28)) == 0) && ((SYSCTL0->PDSLEEPCFG1 & (1U << 28)) != 0))
    {
        (*pSlowSwitches)++;
    }

    /* SRAM */
    for (i = 0U; i < 32U; i++)
    {
        if ((((SYSCTL0->PDRUNCFG2 & (1U << i)) == 0) && ((SYSCTL0->PDSLEEPCFG2 & (1U << i)) != 0)) ||
            (((SYSCTL0->PDRUNCFG3 & (1U << i)) == 0) && ((SYSCTL0->PDSLEEPCFG3 & (1U << i)) != 0)))
        {
            (*pFastSwitches)++;
        }
    }
}

AT_QUICKACCESS_SECTION_CODE(static uint32_t POWER_CalculateSafetyCount(uint32_t clkMhz))
{
    uint32_t ns = 0;
    bool flag, step6Flag, step7Flag;
    uint32_t temp, groups, fastSwitches, slowSwitches;

